Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.130/PIC32CK-SG00-S1/edc/PIC32CK2051SG00100S1.PIC
      <edc:SFRDef ltx:memberofperipheral="MAILBOX" edc:cname="FIFO1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x50000004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MAILBOX">
            <edc:SFRFieldDef edc:cname="Data" edc:nzwidth="0x20" edc:desc="Mailbox data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MAILBOX" edc:cname="FIFO2" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x50000008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MAILBOX">
            <edc:SFRFieldDef edc:cname="Data" edc:nzwidth="0x20" edc:desc="Mailbox data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MAILBOX" edc:cname="FIFO3" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x5000000C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MAILBOX">
            <edc:SFRFieldDef edc:cname="Data" edc:nzwidth="0x20" edc:desc="Mailbox data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MAILBOX" edc:cname="FIFO4" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x50000010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MAILBOX">
            <edc:SFRFieldDef edc:cname="Data" edc:nzwidth="0x20" edc:desc="Mailbox data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MAILBOX" edc:cname="FIFO5" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x50000014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MAILBOX">
            <edc:SFRFieldDef edc:cname="Data" edc:nzwidth="0x20" edc:desc="Mailbox data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MAILBOX" edc:cname="FIFO6" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x50000018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MAILBOX">
            <edc:SFRFieldDef edc:cname="Data" edc:nzwidth="0x20" edc:desc="Mailbox data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MAILBOX" edc:cname="FIFO7" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x5000001C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MAILBOX">
            <edc:SFRFieldDef edc:cname="Data" edc:nzwidth="0x20" edc:desc="Mailbox data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MAILBOX" edc:cname="FIFO8" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x50000020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MAILBOX">
            <edc:SFRFieldDef edc:cname="Data" edc:nzwidth="0x20" edc:desc="Mailbox data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MAILBOX" edc:cname="FIFO9" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x50000024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MAILBOX">
            <edc:SFRFieldDef edc:cname="Data" edc:nzwidth="0x20" edc:desc="Mailbox data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MAILBOX" edc:cname="FIFO10" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x50000028">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MAILBOX">
            <edc:SFRFieldDef edc:cname="Data" edc:nzwidth="0x20" edc:desc="Mailbox data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MAILBOX" edc:cname="FIFO11" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x5000002C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MAILBOX">
            <edc:SFRFieldDef edc:cname="Data" edc:nzwidth="0x20" edc:desc="Mailbox data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MAILBOX" edc:cname="FIFO12" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x50000030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MAILBOX">
            <edc:SFRFieldDef edc:cname="Data" edc:nzwidth="0x20" edc:desc="Mailbox data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MAILBOX" edc:cname="FIFO13" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x50000034">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MAILBOX">
            <edc:SFRFieldDef edc:cname="Data" edc:nzwidth="0x20" edc:desc="Mailbox data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MAILBOX" edc:cname="FIFO14" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x50000038">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MAILBOX">
            <edc:SFRFieldDef edc:cname="Data" edc:nzwidth="0x20" edc:desc="Mailbox data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MAILBOX" edc:cname="FIFO15" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x5000003C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MAILBOX">
            <edc:SFRFieldDef edc:cname="Data" edc:nzwidth="0x20" edc:desc="Mailbox data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
